Repository: Ertugrul-Kurubal/Data-Scientist
Catalog: Work/Modern Ways/Read Corpus/af-ar.tmx
Source language: af
Languages: ar

source: Dit sit gewoonlik ingebed in hul kodering volgorde.
ar: عادة يكون في مكان ما في تسلسل الترميز الخاص بهم

source: Laat ons kyk of ons Picasso 'n teken agtergelaat waarmee ons hom kan identifiseer.
ar: دعونا نرى ما اذا كان بيكاسو ترك لدينا علامة التي يمكننا استخدامها كبطاقة تعريف له

source: Wie het nou die leiding?
ar: من المسئول الآن؟

source: Wie is ons techie?
ar: أيهما هو فنينا

source: - Danielle Benton.
ar: دانييل بنتون

source: Gevorderde rekenaar ingenieursdiploma van Carnegie Mellon.
ar: هندسة الكمبيوتر المتقدمة من جامعة كارنيجي ميلون

source: - Ons lewe in 'n vreemde wêreld, McGee.
ar: نحن نعيش في عالم غريب ،يا ماكجي

source: Ek het heimwee na die tyd dat computernerds op jou leke.
ar: أفتقد تلك الأيام عندما كان مهووسي الكمبيوتر يبدون مثلك.

source: Danielle Benton.
ar: دانييل بنتون

source: NCIS, ons moet met u praat.
ar: NCIS . نحن بحاجة أن أتكلم معك .

source: Die vloot.
ar: البحرية

source: Die besoedelaars van ons see.
ar: ملوثي محيطاتنا

source: Doders van onskuldig mariene lewe.
ar: قاتلي الحياة البحرية البريئة

source: Ek het nie geweet dat dit in die folder staan?
ar: لم أكن أعرف أنهم وضعوا هذا في الكتيب

source: Kom dit jou bekend vir?
ar: هل هذه تبدو مألوفة ؟

source: Dit lyk op die rekenaarprogram dat ek ontwerp het vir my eindwerk.
ar: يبدو أنه برنامج كمبيوتر مصممته لمشروع أطروحتي .

source: Bachelor in terrorisme?
ar: ممممم . درجة في الإرهاب؟

source: - Terrorisme?
ar: الإرهاب؟

source: Ja, jy cijfertjes mengelmoes is geïnstalleer op die olie platform van CityLine, voor die ontplof het.
ar: نعم ، أرقامك الصغيرة تم تثبيتها على متن منصة نفطية ل سيتي لاين قبل انفجارها .

source: - Hoe het geraak die program dat jy ontwerp dan in hul stelsel?
ar: أنا لا أعرف شيئا عن ذلك . ثم كيف

source: - Ek het die drie jaar gelede, online.
ar: للبرنامج الذي صممته انتهى به المطاف في نظامهم ؟ أنا نشرته على الانترنت قبل ثلاث سنوات .

source: Dit is 'n skool dokument.
ar: انها ورقة للكلية.

source: Eender wie kon dit dupliseer.
ar: يمكن لأي شخص ينسخها .

source: Die kode kon geen ontploffing veroorsaak.
ar: ولكن ليس هذا رمز يمكن أن يسبب انفجار.

source: - Waarom nie?
ar: لماذا؟

source: Dit is 'n hulpmiddel vir die invordering van inligting teen maatskappye.
ar: انها مصممة لتكون أداة لمكافحة الشركات جمع المعلومات الاستخبارية ،

source: Toegang tot interne kommunikasie en data.
ar: الوصول إلى السجلات و الداخلية بيانات الاتصالات .

source: Daar is geen moontlikheid om iets in te voer.
ar: لا يوجد له أي قدرة إدخالية

source: Dit is alleen kyk, raak nie.
ar: إنه للنظر لا للمس

source: Sy het gelyk.
ar: أنها على حق

source: - Kyk maar raak nie.
ar: ألم يعلمونك ؟

source: Leer hulle jou dat op MIT?
ar: M.I.T.في

source: Rekenaar programmering is baie verander sedert die jaar 2000.
ar: برمجة الكمبيوتر تغيرت كثيراً منذ مشكلة Y2K

source: Tyd vir 'n opknappingskursus.
ar: حان الوقت لتجديد المعلومات.

source: Jammer, McGeek, jy is onttroon.
ar: آسف ، ماكجي ، لقد قد تم خلعك من على العرش

source: Alle heil aan die koningin.
ar: الجميع يحيي الملكة .

source: Ek ry.
ar: أنا سأقود

source: Nee, nee, dit is nie langs daar.
ar: أه ، لا، لا ، ليس من هنا

source: Die brug is afwaarts onder die helipad.
ar: اه ، والجسر هو ... إنه بالأسفل تحت مهبط للطائرات

source: Is jy al voorheen aan boord gewees?
ar: أكنت على متن المنصة هنا من قبل؟

source: Nee, ek weet my weg op 'n platform.
ar: لا، أنا فقط أعلم طريقي حول الحفار

source: Tydens my laaste missie in die vloot sit ek in 'n veiligheidsploeg op die Al
ar: من خلال جولتي السابقة في مشاة البحرية كنت مع مجموعة الأمن

source: - Kashir olie platform in Irak.
ar: على منصة القشير للنفط في العراق

source: Goed, ons is daar.
ar: حسنا, ها نحن هنا

source: Hebner het die oefening gelei vanuit hierdie ruimte.
ar: هيبنر كان يدير التحكم من هذا المكان

source: Wat verduidelik hoe hy in die water is geraak.
ar: حسنا، هذا يفسر كيف حصل على الماء

source: Al
ar: القشير هذا كان يعتبر

source: - Kashir, dat is beskou as 'n gevaarlike opdrag, is dit nie?
ar: واجب تكليفي خطير, أليس كذلك؟

source: Ja, ons was 'n voortdurend doel.
ar: نعم كنا هدف ثابت

source: Boot aanvalle, selfmoord, bedreiging in alle groottes en gewigte.
ar: غارات القوارب ، الانتحاريين - وجاءت تهديدات في جميع الأشكال و الأحجام.

source: Was dit nooit op die randjie?
ar: أكان أي منها قريبا

source: Ja, een keer.
ar: نعم ، مرة واحدة ...

source: Tydens 'n roetine patrollie, was daar 'n noodoproep van 'n visserman met sy jong seun.
ar: على دورية روتينية. حصلت على اشارة استغاثة من صياد محلي مع ابنه الصغير

source: Ons sien die vaartuig en ons is langszij gegaan om dit te inspekteer.
ar: رصدنا السفينة ،ثم سحبناها جنبا إلى جنب مع للتفتيش.

source: Toe ons aan boord gegaan het, ontplof daar 'n springtuig.
ar: بينما كانت لا نزال تصعد ، انفجرت عبوة ناسفة .

source: Ons verloor drie man, enkele sekondes later en ek was by hulle gewees.
ar: فقدت ثلاثة من الرجال ؛ بضعة ثواني ، كنت لأكون معهم

source: Dit is lank gelede, Gibbs, ek konsentreer me liewer op wat dit veroorsaak het.
ar: وكان هذا منذ زمن بعيد يا جيبس أنا أفضل أن نركز على إيجاد أياً كان سبب هذا الانفجار

source: Wel, ek dink dat ons dit het.
ar: أعتقد أن لدينا فقط .

source: Ja, nou, dat is die ontsteker.
ar: نعم، حسنا ... هذا هو المفجر .

source: Of wat daarvan oor bly.
ar: أو ما تبقى منه .

source: Daar gaan die ongeluk waar ek op gehoop het.
ar: حسنا، ها هي نظرية أنه كان حادثاً التي كنت أأمل فيها تذهب .

source: Van alle ruimtes om 'n bom te lê, waarom die brug?
ar: أتعلم، كل المساحات لزرع القنبلة ، لماذا الجسر ؟

source: As jy 'n boom wil velle, doen dit by die stam, nie aan 'n tak.
ar: إذا كنت تريد أن تقلع شجرة تفعل ذلك من الجزر لا من الفرع.

source: Miskien gaan dit nie om die ruimte.
ar: ربما لم يكن حول المساحة

source: Die platform was nie die teiken.
ar: المنصة لم تكن الهدف .

source: Marv Hebner was die.
ar: كان مارف هيبنر .

source: 'n Ontsteker?
ar: مفجر؟

source: Dui u daarop dat een van ons mans 'n bom op die platform het gelê?
ar: أنت تشير أحد رجالنا زرع قنبلة على المنصة ؟

source: Dat is stapelgek.
ar: هذا جنون .

source: - Elke werknemer van CityLine is gekeur en is onderworpe aan 'n uitgebreide agtergrond ondersoek.
ar: كل موظفي سيتي لاين يتم فحصهم بشكل صحيح ويمروا من خلال تحقيق واسع

source: Vir hulle aangeneem word.
ar: قبل إتمام تعاقدهم

source: Niemand het 'n "gevaarlik" sein.
ar: لم يشر لأي من بأعلام حمراء .

source: Iemand nou wel.
ar: شخص ما الآن .

source: - Had Marv geen probleme met 'n bemanningslid?
ar: أكان مارف هيبنر يمر بأي مشاكل

source: - Ek sou dit geen probleem noem.
ar: مع طاقمه الخاص؟ لن أقول مشكلة .

source: Ek weet dat hy 'n rusie het met Jonah McGuire, die leier van die bedrywighede.
ar: كنت على بينة بمشاحناته ل جونا ماجواير ، ضابط العمليات عن ماذا؟

source: - Waaroor? McGuire het ' n verslag vir oortreding van die veiligheid tydens 'n onlangse OSHA inspeksie.
ar: تنويه ماجواير لانتهاك سلامة

source: - Die maatskappy het besluit om
ar: خلال عملية تفتيش الأخيرةOSHAال .

source: McGuire te laat gaan.
ar: قررت الشركة بتسريح ماجواير

source: 'n Besluit wat Hebner gesteun het.
ar: لقد كان قرارا وقع عليه هيبنر .

source: Het McGuire geweet dat hy moes gaan?
ar: أعرف ماجواير أنه سيتم التخلي عنه ؟

source: - Die papier was nog nie rond.
ar: كان العمل الكتابي لا يزال بإنتظار اللمسات الأخيرة ،

source: - Dat is nie sommer 'n "gevaarlik" sein, dit is 'n motief.
ar: لكنه رأى الكتابة على الجدار . هذا ليس مجرد علم احمر ؛ هذا هو الدافع .

source: Waarom sou iemand Marv wil doodmaak?
ar: لماذا يريد البعض قتل مارف ؟

source: - Ons het gehoop dat jy dit ons kon vertel.
ar: كنا نأمل أن تقول أنت لنا .

source: Ek het geen idee.
ar: ليس لدي أي فكرة .

source: - Dit is nie wat ons hoor.
ar: هذا ليس ما سمعناه .

source: Julle het blykbaar 'n verskil van mening.
ar: يبدو وكأنه كان لديك فأس كبيرة جدا لطحنه .

source: - Dan is jy verkeerd ingelig.
ar: إذاً معلوماتك خاطئة .

source: Marv was my beste vriend.
ar: كان مارف أقرب صديق لي.

source: - Jy trekpas tekens was nie baie vriendelik.
ar: توقيع أوراق إنهاءك الخاصة لم تكن تدل على صداقة .

source: Vriende word veronderstel jy rugdekking te gee en nie daar in te steek.
ar: ومن المفترض أن يحمي الأصدقاء ظهرك ، لا طعنه.

source: Dit is nie wat dit lyk, ek was nie kwaad oor my ontslag.
ar: هذا ليس ما يبدو. لم أكن غاضبا منه ل طردي .

source: Dit was my idee.
ar: كانت تلك فكرتي .

source: Dit hou geen steek.
ar: هذا لا معنى له.

source: Gebeur nogal dikwels vandag.
ar: هناك الكثير من ذلك يحدث اليوم .

source: Marv het die veiligheidsfout gemaak, nie ek nie.
ar: كان مارف هو الذي أخطأ لذلك لإنتهاك السلامة ، ليس أنا .

source: Ek het dit op me geneem, want ek het geweet wat die gevolge sou wees.
ar: أخذت الخطوة لأنني كنت أعرف ماذا ستكون العواقب

source: Jy het gelieg dus, om afgedank te word.
ar: لذلك أنت كذبت من أجل الطرد

source: Dit hou nog steeds geen steek.
ar: - لا يزال ليس له معنى

source: Jy verstaan nie wat die baan vir Marv beteken.
ar: أنت لا تفهم ماذا تعني المهنة ل مارف

source: 'n OSHA oortreding sou sou sy loopbaan verwoes het.
ar: و مخالفة OSHA قد تدمر حياته المهنية. أنا ..

source: Ek kon dit nie laat gebeur, na al wat hy al vir my gedoen het.
ar: أنا لا يمكن أن أسمح لذلك أن يحدث بعد كل الأشياء التي فعلها لي

source: Ek het hom nie gedood.
ar: أنا لم أقتله .

source: Ek het probeer om hom te beskerm.
ar: كنت ... كان أحاول حمايته .

source: Perfekte tydsberekening, soos steeds.
ar: توقيت مثالي ، كما هو الحال دائما . أكنت تتوقعينني أنا؟

source: Ek is so bly om jou te sien, ek bedoel, ek is nie gelukkig om die lyk en so.
ar: عميل بورين

source: Maar ek is bly dat jy daar is.
ar: أعني، أنا لست سعيدة حول وضع وجود جثة و قبل كل شيء، ولكن أنا فقط ، أنا سعيدة حقا أنك هنا .

source: Wat dink jy hiervan?
ar: و ماذا عن ...

source: Oh, dat is 'n hoop geneentheid vir wat kafeïen.
ar: الآن ؟ اه. وهذا هو الكثير من المودة بالنسبة لبعض الكافيين .

source: Ek sou meer dikwels moet kom.
ar: وعلي أن أأتي هنا في كثير من الأحيان .

source: Ja, daar is ek dit 110% mee eens.
ar: نعم. أنا أتفق مع ذلك 110٪ .

source: Hoewel dat getalsmatig nie moontlik is.
ar: على الرغم من أن هذا ليس ممكن عدديا ،

source: Om iets te beklemtoon, werk dit volkome.
ar: للتأكيد ، يعمل تماما .

source: - Ek is bly dat ek kan help.
ar: سعيدة أنه يمكنني المساعدة.

source: Nou is dit my beurt om jou te help.
ar: حسنا ، والآن حان دوري لأقوم بمساعدتك.

source: - Wat het jy, Abbs?
ar: على ماذا حصلت ..

source: Ek verwerk die puin van die platform nog, dit kan nog even duur.
ar: يا أبس ما زلت أعالج الحطام من المنصة - وهذا سيستغرق بعض الوقت -

source: Maar ek kan jou wat vertel oor die bom.
ar: ولكن أستطيع أن أعطيك بعض المعلومات حول القنبلة نفسها .

source: - Dat is goed.
ar: هذا امر جيد .

source: Nie regtig nie.
ar: لا.

source: Die ontstekertelefoon is 'n weggooibare tipe daar is dus geen spoor en die hoof bestanddeel van die plofstof was suiwer kruit.
ar: الهاتف الخلوي المفجر هو يمكن التخلص منه ، لذلك ليس هناك خيط. و العبوة الناسفة ، المكون الرئيسي

source: Wat nie gereguleer is en feitlik onmoontlik om op te spoor.
ar: التي ليست منتظمة ، مما يجعلها من المستحيل تقريبا تتبعها .

source: Ons weet dat die bom maar 'n minimaal skadelik vermoë het.
ar: نحن نعلم أن القنبلة حصلت على الحمولة الأقل ضرراً ،

source: Ons het dus nie te maak met 'n professionele terrorist
ar: لذا نحن لا نتعامل مع بعض المحترفين من الإرهابيين العظام

source: Maar dit was nie nodig, met al die vlambare materiaal aan boord van 't platform, was net die regte ontsteking nodig om 'n kettingreaksie te veroorsaak.
ar: لكنها لم تكن في حاجة إلى أن تكون. مع كل الغازات القابلة للاشتعال والمواد على متن المنصة

source: Dit bring my by my volgende interessante feit.
ar: الذي يقودني إلى الحقيقة المقبلة مثيرة للاهتمام.

source: Afgaande op die ontploffingsradius, was die geplaas op die ene plek op die brug, waar die kettingreaksie nie die hele platform sou verwoes.
ar: إعتمادا على أساس من الجهاز دائرة نصف قطر الانفجار ، لقد تم وضعه في بقعة واحدة على الجسر حيث سلسلة من ردود الفعل

source: Óf het hulle baie geluk, of die bomlegger het 'n deeglike kennis van die struktuur.
ar: إما لأنهم كانوا محظوظين حقا ... أو أن المفجر لدينا لديه معرفة وثيقة

source: Ek glo nie in geluk.
ar: أنا لا أعتقد في الحظ .

source: Goed gewerk, Abbs.
ar: عمل جيد ، يا اابس

source: Ek het 'n ongemaklik gevoel, McGee.
ar: لدي شعور بعدم الارتياح ،يا ماكجي .

source: Ek het gesê jy nog geen Chinees te bestel in 'n Meksikaanse restaurant.
ar: حسنا ، قلت لك لا تطلب طعام صيني من مطعم مكسيكي

source: Ek het dit oor SecNav.
ar: أنا أتحدث عن وزيرة البحرية

source: Sy hang hier baie rond die laaste tyd.
ar: انها تسكع هنا كثيرا في الآونة الأخيرة

source: Spreek geen kwaad oor Jose de Mandaryns.
ar: لا تتحدث بسوء عن خوسيه ماندرين

source: Sy loempia 's is baie goed. - Luister, dit is die NCIS,
ar: انظر، هذا هو NCIS ، وزيرة البحرية بورتر

source: Porter is SecNav, sy doen net haar werk.
ar: انها فقط تقوم بوظيفتها .

source: Ek het dieselfde sleg gevoel in Ohio as stage student.
ar: كان لدي نفس الشعور سيء مرة عندما كنت في أوهايو في سنة دراستي الثانية

source: Daar kom toe ook 'n nuwe trainer.
ar: أحضروا لي مدرب جديد .

source: 'n Nuwe trainer beteken 'n nuwe ploeg.
ar: المدرب الجديد يعني تشكيلة جديدة

source: Dink jy dat SecNav die boel hier gaan uitruiling?
ar: أتعتقد أن وزيرة البحرية هنا لتقوم ببعض التغييرات هنا

source: Nie bekommerd wees nie, ek staan agter jou.
ar: لا تقلق ، أنا سأحمي ظهرك .

source: Elke span het 'n waterjongen nodig.
ar: كل فريق يحتاج إلى صبي الماء .

source: Waar staan ons?
ar: أين نحن؟

source: Ek het die CityLine personeel nagegaan, niks opmerklik.
ar: اه، تحققنا من بعض الخلفيات عن موظفين سيتي لاين - لا شيء يذكر .

source: Boetes vir openbare dronkenskap, agterstallige motor betalings en flinke 1-900 rekeninge vir 'n man wat nooit van die internet gehoor het.
ar: الغرامات لتسممات عامة ، مدفوعات السيارات الجانحة و بعض تهم I-900 الخطيرة إلى رجل

source: Ek het iets.
ar: الذي من الواضح أنه لم يسمع أبدا عن الإنترنت . أنا عندي شيء .

source: Die hele voedsel diens van die platform was gehuur via 'n derde party.
ar: فريق الخدمات الغذائية بأكمله على متن المنصة تم التعاقد معه من خلال طرف ثالث .

source: Dit beteken dat hulle nie deur CityLine werden gekeur.
ar: وهو ما يعني لم يكن عليهم الذهاب خلال فحوصات سيتي لاين الخلفية

source: Hulle sou tog nie op die brug mag kom.
ar: وهو لا زالوا لم يحصلوا على الترخيص المناسب

source: - Iemand met 'n kriminele verlede?
ar: للوصول إلى الجسر. أي شخص لديه سوابق جنائية ؟

source: Lenny Pachaca, 'n kok.
ar: ليني باتشاكا, رئيس خط طباخين

source: Werk onder die naam, "Lenny Machaca".
ar: يعمل تحت اسم مستعار " ليني ماتشاكا . " مممم .

source: Hy hou daar tog geen ander mening op na?
ar: لم يكن يفكر خارج المألوف في هذه ، أليس كذلك؟

source: - Hy het gesit vir besit en vervoer van plofstof.
ar: وقضى قتا لحيازة و نقل المتفجرات .

source: - DiNozzo, haal Borin en pak hom op.
ar: دينوزو, خذ بورين واجلبوه لهنا

source: Ek hou van die reuk.
ar: أنا أحب تلك الرائحة

source: Vrot vis en diesel.
ar: تعفن الأسماك و وقود الديزل ؟

source: - Ja, asem dit in.
ar: نعم ، تتنفسه

source: Jy is 'n besondere vrou, Borin.
ar: أنت سيدة متميزة يا بورين

source: Ek popel om die man met die hout been te ontmoet wat jou mislei.
ar: لا استطيع الانتظار لألقى الرجل صاحب الأرجل الصناعية الذي سيسحرك

source: Jo, ho, ho, DiNozzo.
ar: يو هو هو ، دينوزو .

source: - Lenny Machaca?
ar: ليني ماتشاكا ؟

source: Oh, kom nou.
ar: مهلا .. أوه ، هيا ...

source: - Ek sny hom die pas af.
ar: أنا سأقطع الطريق عليه .

source: Sagtebal gespeel op skool.
ar: بيسبول خلال الكلية

source: Sagtebal?
ar: أعسر ؟

source: - Ek slinger in beide rigtings.
ar: أنا أتأرجح في كلا الاتجاهين .

source: Ek dink dat dit gekke wijf my ribbes gebreek het.
ar: وأعتقد أن هذه المجنونة كسرت أضلعي .

source: Glo my, Len, stop beter as jy dit kan.
ar: ثق بي، لين ... كنت ترغب لتتخلى عن ذلك بينما أنت هنا

source: - Jy asemhaal nog.
ar: و أنت لا تزال تتنفس .

source: Ek het dit al gesê, julle het die verkeerde.
ar: سبق لي أن قلت لك ... لقد أمسكت بالرجل الخطأ

source: Volgens my ervaring loop die een wat wat te verberg het weg van die flikken.
ar: من واقع خبرتي فقط الرجال الذين لديهم ما يخفونه يفرون من الشرطة

source: En skuilname gebruik.
ar: يستخدمون الأسماء المستعارة .

source: - Ek sien wat julle probeer.
ar: أرى ما تحاولون أن تفعلوا

source: Maar jy gaan my die skuld gee nie.
ar: لكن لن تلصقوا هذا بي

source: - Ek het dit nie gedoen nie.
ar: أنا لم أفعل هذا.

source: Jy beweer ook dat jy geen probleme het met Marv Hebner.
ar: حسنا، أنت تدعى أيضا أنك لم يكن لديك أية مشاكل مع مارف هيبنر ،

source: Maar jy hoof, sê dat hy klagtes oor jy gehad het.
ar: حتى الآن يقول مشرفك والذي أدلى بالشكاوى عنك .

source: Hy sê dat jy 'n nie gelei projektiel is.
ar: وقال أنك كنت شخص مندفع .

source: - Is jy onvoorspelbaar, Len?
ar: أأنت غير ممكن التنبؤ بك ، ليون ؟

source: Jy mag hom dalk nie, want hy het jou aan die reëls gehou.
ar: أراهن أنك لم تحب أن يتحكم بك

source: Hy was 'n koppige donkie.
ar: لقد كان أخرقاً بدون مشاعر

source: Hy het teen almal tekere as verdomde 'n sersant.
ar: امتطى الجميع كرقيب حفر لعين

source: Hy was die vloot nie.
ar: لم يكن هذا هو المارينز .

source: Hy het te ver gegaan met die verkeerde
ar: أعتقد أنه دفع أخيرا الرجل الخطأ بعيدا جدا

source: - Die verkeerde met kriminele verlede in plofstof? Daar is slegs 'n man aan boord wat daaraan beantwoord en dat is jy.
ar: الرجل الخطأ المجرم مع خلفية عن المتفجرات؟

source: - Aangehou vir besit van C -4, laders, ontstekers en buskruit.
ar: والذي يلبي هذه المعايير وهذا. هذا هو أنت اعتقلت لحيازتك

source: Oh, Lenny, oude gewoontes leer je moeilijk af.
ar: أوه ، ليني ... العادات القديمة لا تموت بسهولة .

source: Dat is lang geleden, OK.
ar: كان ذلك منذ زمن طويل ، حسناً ؟

source: Ik en mijn vriend kickten ervan om dingen op te blazen, niemand werd gewond.
ar: صديقي و أنا حصلنا على ركلة خروج من تفجير الاشياء. ولم يصب أحد

source: Ons het net pret.
ar: كنا فقط نلهو .

source: Het was pret?
ar: كان مجرد لهو ؟

source: - Ja, gewoon een manier om te niksen.
ar: نعم. مجرد وسيلة للبلاهة .

source: Ek het nooit die drukmakery verstaan, dus.
ar: لم نر أبدا ماذا كانت المشكلة لذا هل لديك ...

source: - Het jy al ooit gesien wat die pret uithaal met 'n menseliggaam op kort afstand?
ar: هل رأيت من ماذا يمكن لهذا اللهو أن يفعل؟ لجسم الإنسان من مسافة قريبة ، ليني ؟

source: Die begin met 'n flits van lig, die uit het niets kom.
ar: اسمح لي أن أنيرك .

source: Jy is tydelik verblind, maar glo my dat is 'n seën.
ar: أنت أعمى مؤقتا ، ولكن ثق بي ، هذا نعمة ،

source: want die laaste ding wat jy wil sien is wat daar met jou gaan gebeur.
ar: لأن آخر شيء تريد أن تراه هو ماذا على وشك الحدوث لك

source: Dan is daar die klank, die hardste wat jy in jou lewe al gehoor het.
ar: و بعد ذلك هناك الصوت. انه أعلي صوت يمكنك أن تسمعه في حياتك كلها

source: Dit is ook die laaste wat jy ooit hoor.
ar: وهو أيضا آخر صوت يمكنك سماعه على الإطلاق

source: Dan is daar die stilte.
ar: و بعد ذلك هناك الصمت

source: Jy hoor jouself nie eens meer skree.
ar: وأنت لا تستطيع حتى أن تسمع نفسك تصرخ

source: As die hitte jou vel doen smelt en die skerwe deur jou liggaam skeur.
ar: كما أن الحرارة الناتجة من الإنفجار ستذيب جلدك و الشظايا تمزق جسدك

source: Dus, vertel me eens, Len, het ons pret?
ar: لذا. لماذا لا تخبرني يا ليني

source: Vind jy dit pret?
ar: أحصلنا على متعتنا بعد هاه ؟ أهذا متعة بالنسبة لك ؟

source: Ek luister hier nie meer na.
ar: انتهيت من الاستماع لهذا . أوه ، يا إلهي ، أنت حتى لم .

source: - O, nee, ons is pas begin.
ar: مهلا، لقد بدأنا للتو .

source: Dus, jy bly sit waar jy is.
ar: فلماذا لا تقوم البقاء حيث أنت ؟ عميلة بورين

source: Neem 'n breek.
ar: خذي قسط من الراحة .

source: Luister, ek gebruik ' n alias omdat ek anders geen werk vind met my verlede, OK?
ar: انظر، أنا فقط استخدم اسم مستعار لأنني لم أستطع الحصول على وظيفة بسجلي

source: Ek moet vir my gesin sorg.
ar: حسنا, لدي عائلة لتوفير

source: Meer het ek nie gedoen nie, ek sweer het.
ar: هذا كل ما قمت به، أقسم .

source: Leg me aan die leuenverklikker, maar hou haar uit my buurt.
ar: سآخذ جهاز كشف الكذب أو أيا كان، فقط ... أبقوها بعيدة عني .

source: Wel, ek het altyd deeltyds gewerk in die Green Dragon taverne.
ar: حسنا، لقد كنت دائما جزءاً من حانة التنين الأخضر

source: Op Dinsdag hulle georganiseer...
ar: الثلاثاء سوف تستضيف ...

source: - Trivia oor Amerikaanse geskiedenis.
ar: التاريخ الأميركي triviology .

source: Ek is daar elke week heen gegaan.
ar: أنا أعلم، أنا أذهب كل أسبوع .

source: - Goed, hoe sit dit buite Cambridge?
ar: حسنا ، ماذا عن خارج كامبردج ؟

source: Moeilik keuse, maar dan gaan ek vir...
ar: خيار صعب ، لكن علي أن أذهب مع يا رئيس

source: Baas. Ek het jou nie sien kom.
ar: لم أرك تقترب

source: Jy vra jy vas af wat ek doen?
ar: ربما كنت تتساءل عما أفعله .

source: Ons het dit oor ons akademiese verlede in Boston.
ar: كنا نناقش فقط تاريخ الأكاديمية لدينا في بوسطن .

source: MIT, Harvard.
ar: M.I.T. ، هارفارد .

source: Verskoon, dankie vir die wandeling deur die herinneringe, Tim.
ar: إسمحوا لي . شكرا على رحلة ممر الذكريات ،يا تيم .

source: Ja, mev.
ar: نعم ، سيدتي .

source: Porter.
ar: بورتر.

source: - Wat het jy gevind?
ar: ماذا وجدت ؟

source: Heel wat eintlik.
ar: لا بأس به ، في الواقع .

source: Sy skryf vir die "Crimson".
ar: كتبت للكريمسون، كانت عضوا في نادي النقاش ،

source: Sy was 'n lid van die bespreking klub, magna cum laude gegradueer.
ar: تخرجت بامتياز .

source: Oor die saak, McGee?
ar: عن القضية ، ماكجي . اه.

source: - Oh. Juis.
ar: صحيح .

source: Wel, sedert hy vrygelaat is het Lenny sy kriminele rekord proper gehou.
ar: حسنا ، منذ ، اه ، خروجه من السجن ، وأبقى ليني سجله نظيفاً.

source: Sy alibi is bevestig deur twee ander kokke aan boord.
ar: تأكدت من أعذاره مع اثنين آخرين من الطهاة على متن المنصة

source: Hulle het gesê dat hy gewerk het in die kombuis tot aan die oefening.
ar: يقولون انه يعمل كامل اليوم على الطوابق الفوضية حتى الحفر.

source: Dit is nie regtig 'n spoor.
ar: وهذا ليس بكثير كخيط.

source: Dit wel.
ar: هذا كذلك .

source: Kyk 'n bietjie.
ar: تحقق من هذا

source: Skedules van die olie platform van CityLine.
ar: مخططات ل منصة سيتي لاين النفطية

source: Die maatskappy dat die planne ontwerp, het twee weke gelede 'n probleem met die beveiliging.
ar: الشركة المصممة للمخططات حدث بها إختراق أمني قبل أسبوعين

source: Dit was die enigste lêer wat in die gedrang is.
ar: وكان هذا الملف فقط ما تم المساس بها. خرق من أي نوع؟

source: Wat soort inbreuk was dit? - Dieselfde malware as wat ons gevind het op die mainframe van CityLine.
ar: نفس النوع من البرمجيات الخبيثة

source: - Een persoon wat hulle in gemeen het.
ar: التي وجدناها على وحدة سيتي لاين المركزية شخص واحد هو المشترك .

source: Soek haar, McGee.
ar: اعثر عليها ،يا ماكجي وداعا وداعا

source: Ek het gedink dat dit maar 'n mite was.
ar: وأعتقد أن تلك الخطوة كانت أسطورة حضارية نقية

source: - Is daar iets wat jy wil deel?
ar: شيء ما تهتمين لمشاركته

source: Mev die sekretaris?
ar: سيدتي الوزيرة ؟

source: - Verskoon?
ar: عفوا ؟

source: Is daar 'n rede vir jou teenwoordigheid, buite hierdie navorsing?
ar: هل هناك سبب آخر لحضورك هنا ، وبالاضافة الى هذا التحقيق؟

source: Wat in my agenda staat, gaan bo jou graad, agent Gibbs.
ar: هذه مسائل تخص جدول أعمالي وهي فوق درجة صلاحياتك عميل جيبس .

source: As dit my of my span mag behels, dan moet ek dit, met respek, nie eens sy.
ar: إذا كان يخصني أو يخص فريقي، أنا بكل احترام أرفض.

source: Wees gerus, my teenwoordigheid op die NCIS is suiwer saak gebind.
ar: اضمئن ، وجودي هنا هو خاص بالقضية تماما

source: Jy het jou beveel en ek ook.
ar: لديك أوامرك. وكذلك أنا

source: As 'n persoon met 'n agtergrond in sake, sou ek nalatig sy, as ek geen gate sien op hierdie agentskap as dit op mannekrag aankom.
ar: ومع ذلك ، كشخص مع خلفية في مجال الأعمال التجارية ، وسأكون مقصرة إذا لم أتبين بعض الفجوات

source: Personeelskwesties is onder jou graad.
ar: قضايا التوظيف هي أدني من صلاحياتك

source: Nie as dit die opbrengs van die NCIS aantas.
ar: لا لو كانت تؤثر على كفاءة هذه الوكالة

source: Dit is nie so nie.
ar: فهو ليس كذلك.

source: - Ek is dit eens.
ar: وأنا أتفق.
